#+AUTHOR:Ernests Kuznecovs - 17332791 - kuznecoe@tcd.ie
#+Date:2nd March
#+Title:Optimisation Algorithms - Week 6 Assignment

#+begin_export latex
\definecolor{codegreen}{rgb}{0,0.6,0}
\definecolor{codegray}{rgb}{0.5,0.5,0.5}
\definecolor{codepurple}{rgb}{0.58,0,0.82}
\definecolor{backcolour}{rgb}{0.95,0.95,0.92}

\lstdefinestyle{mystyle}{
    backgroundcolor=\color{backcolour},   
    commentstyle=\color{codegreen},
    keywordstyle=\color{magenta},
    numberstyle=\tiny\color{codegray},
    stringstyle=\color{codepurple},
    basicstyle=\ttfamily\footnotesize,
    breakatwhitespace=false,         
    breaklines=true,                 
    captionpos=b,                    
    keepspaces=true,                 
    numbers=left,                    
    numbersep=5pt,                  
    showspaces=false,                
    showstringspaces=false,
    showtabs=false,                  
    tabsize=2
}
\lstset{style=mystyle}
#+end_export
* Obtaining Functions :noexport:

#+begin_src python :results none :exports none :tangle ./Week6Src.py
import numpy as np

def generate_trainingdata(m=25):
    return np.array([0,0])+0.25*np.random.randn(m,2)

def f(x, minibatch):
    # loss function sum_{w in training data} f(x,w)
    y=0; count=0
    for w in minibatch:
        z=x-w-1
        y=y+min(12*(z[0]**2+z[1]**2), (z[0]+8)**2+(z[1]+10)**2)   
        count=count+1
    return y/count

M = generate_trainingdata()
#+end_src

#+begin_src python :results replace :exports none :tangle ./Week6Src.py
def generate_trainingdata(m=25):
    return np.array([0,0])+0.25*np.random.randn(m,2)

def f(x, minibatch):
    # loss function sum_{w in training data} f(x,w)
    y=0; count=0
    for w in minibatch:
        z=x-w-1
        y=y+min(38*(z[0]**2+z[1]**2), (z[0]+9)**2+(z[1]+10)**2)
        count=count+1
    return y/count
M = generate_trainingdata()
print(M)
#+end_src

#+RESULTS:
#+begin_example
[[-0.09162415 -0.34406353]
 [ 0.11348505  0.14783163]
 [-0.1092448  -0.11302683]
 [ 0.4915196  -0.31553493]
 [ 0.13395157  0.02917406]
 [-0.358592   -0.63167542]
 [ 0.04006162 -0.42455172]
 [ 0.37029393 -0.35345275]
 [-0.07575259 -0.19642429]
 [-0.35633779 -0.28766926]
 [ 0.44842531  0.08696532]
 [-0.2143659  -0.12421594]
 [ 0.33090583 -0.21124951]
 [-0.25572899 -0.01782207]
 [-0.24551497  0.02973253]
 [ 0.05316053  0.1892    ]
 [ 0.18237003 -0.35825178]
 [-0.15005759 -0.22135219]
 [ 0.28432854  0.34575478]
 [ 0.29388949 -0.36609193]
 [-0.14714522 -0.08662135]
 [ 0.273882    0.46251424]
 [ 0.40002843  0.27895126]
 [-0.4564874  -0.43876783]
 [-0.45245883  0.17265134]]
#+end_example

** (i) Implementation of SGD
- Use approximate derivatives $Df_{\theta_1}(\theta)$ instead of exact derivatives $\frac{\partial f}{\partial \theta_1} (\theta)$
  - $Df_{\theta_i} = \frac{\partial f}{\partial \theta_i} + noise$
  - For ML we are trying to optimise the function:
    - $J(\theta) = \frac{1}{m} \sum\limits_{i=1}^m loss(\theta, x^{(i)}, y^{(i)})$
    - $(x^{(1)}, y^{(1)}), (x^{(2)}, y^{(2)}), \hdots,(x^{(m)}, y^{(m)})$ is our training data.
    - $loss()$ is a function that measures how well our predictions match the training data.
      - e.g $loss(\theta, x^{(i)}, y^{(i)}) = (\theta^T x^{(i)} - y^{(i)})$ in linear regression.
  - Derivatives:
    - $\frac{\partial J}{\partial \theta_1} (\theta) = \frac{1}{m} \sum\limits_{i=1}^{m} \frac{\partial loss}{\partial \theta_1}(\theta, x^{(i)},y^{(i)}), \frac{\partial J}{\partial \theta_2} (\theta) = \frac{1}{m} \sum\limits_{i=1}^{m} \frac{\partial loss}{\partial \theta_2}(\theta, x^{(i)},y^{(i)})$

    - Pick random sample of b points form training data
    - Let $N$ be the set of indices.
    - Then use approx derivatives:
      - $DJ_{\theta_1} (\theta) = \frac{1}{b} \sum\limits_{i \in N} \frac{\partial loss}{\partial \theta_1}(\theta, x^{(i)},y^{(i)}), DJ_{\theta_2} (\theta) = \frac{1}{b} \sum\limits_{i \in N} \frac{\partial loss}{\partial \theta_2}(\theta, x^{(i)},y^{(i)})$
	- we give it a new N every approximation, its a set of indices into the dataset.
	  - for each i in N (i stands for index)
	- when $b=m$ and $N = \{ 1,2,\hdots,m \}$ we get back exact derivatives.

	- $loss(\theta, x^{(i)}, y^{(i)}) = \frac{1}{2} * (\theta^T x^{(i)} - y^{(i)}})^2$
	- $\frac{\partial loss}{\partial \theta_k} (\theta, x^{(i)}, y^{(i)}) = (\theta^T x^{(i)} - y^{(i)}})x_k^{(i)}$
	- $DJ_{\theta_1}(\theta) = \frac{1}{5} \sum\limits_{i \in N} \frac{\partial loss}{\partial \theta_1}(\theta, x^{(i)}, y^{(i)}) = \frac{1}{5} \sum\limits_{i \in N} (\theta^T x^{(i)} - y^{(i)}})x_k^{(1)}$
	  - and so on for $\theta_2,\hdots$

	- sample with replacement after every update
	  - need to differentiate a new loss function after every iteration?

#+begin_src python :results none :exports code :tangle ./Week6Src.py
x = np.array([1, 2]); b = 5; m = len(M); alpha=0.4; iters=50
for _ in range(iters):
    N = np.random.choice(np.arange(m), b)
    fN = lambda x: f(x, minibatch=M[N])
    DJ = np.array([finite_diff(fN, x, i) for i in range(len(x))])
    x = x - alpha * DJ
#+end_src

#+begin_src python :results none :exports code :tangle ./Week6Src.py
x = np.array([1, 2]); b = 5; m = len(M); alpha=0.4; iters=50
for _ in range(iters):
    np.random.shuffle(D)
    for i in np.arange(0, m, b): # 0 upto m-1, in steps of b. i.e index of each batch start
        N = np.arange(i, i + b)
        fN = lambda x: f(x, minibatch=M[N])
        DJ = np.array([finite_diff(fN, x, i) for i in range(len(x))])
        x = x - alpha * DJ
#+end_src

#+begin_src python :results none :exports code :tangle ./Week6Src.py
f = BatchedFunction(f, M, b=5, iters=50) ; fi = iter(f) ; f = f.function;  
for fN, dfs in fi:
    step = alpha * np.array([df(*x) for df in dfs])
    x = x - step
    
    X += [x] ; Y += [f(*x)]
    return X, Y
#+end_src

#+begin_src python :results replace :exports code :tangle ./Week6Src.py
np.arange(0, 10, 10)
np.arange(0, 0+10)
#+end_src

#+RESULTS:
: array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

** (iii) Calculating Derivative of f
- With Sympy
  - Can I set it up in such a way that can differentiate with the batchiness of it too?

- finite_diff is defined such that can specify which input parameter to the function we add the perturbation.

#+begin_src python :results replace :exports code :tangle ./Week6Src.py
def finite_diff(f, x, i, delta=0.0001):
    d = np.zeros(len(x)) ; d[i] = delta
    return (f(x) - f(x - d)) / delta
#+end_src

- We index our dataset $M$ with $N$ and create a closure in the lambda with the batch.
- Then we can pass the resulting function to the finite difference function.

#+begin_src python :results replace :exports code :tangle ./Week6Src.py
fN = lambda x: f(x, minibatch=M[N])
x = np.array([10, 10])
Dfx1 = finite_diff(fN, x, 0) # w.r.t x1
Dfx2 = finite_diff(fN, x, 1) # w.r.t x2
print(Dfx1)
print(Dfx2)
#+end_src

#+RESULTS:
: 33.807431020795775
: 38.154229460508304

